Revit 2027 API
DirectContext3DHandleSettings.Visibility Property
 Visibility of the handle and the associated DirectContext3D graphics. A value of true means that the graphics are visible.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool Visibility { get; }
Public ReadOnly Property Visibility As Boolean
	Get
public:
property bool Visibility {
	bool get ();
}
member Visibility : bool with get
Property Value
Boolean
See Also
Reference
DirectContext3DHandleSettings Class
Autodesk.Revit.DB.DirectContext3D Namespace